[
    {
        "images": [],
        "text": [
            "\r\n13 сентября 1987 года в жарком бразильском городе Гойяния произошла мелкая кража. Двое мужчин по имени Роберто Алвес и Вагнер Перейра, воспользовавшись отсутствием охраны, пробрались в заброшенный больничный корпус. Разобрав на металлолом странную медицинскую установку, они погрузили детали в тачку и покатили ее домой к Алвесу. Никто не знал, что это начало самого пугающего инцидента с радиоактивными материалами в гражданской сфере.",
            "\r\n",
            "\r\nДа, сотрудники Гойянского Института радиотерапии были в курсе, что при переезде в новое здание установленный в 1977 году громоздкий аппарат лучевой терапии остался на прежнем месте. Но собственник здания открыл имущественный спор с организацией. В дело вступили страховщики, при поддержке полиции запретившие вывозить оставшееся оборудование. На это один из совладельцев Института, Карлос Фигуеиредо Безеррил, только сказал напоследок, что на президенте страховой компании Лисио Боргесе будет лежать ответственность за то, что произойдет с «цезиевой бомбой».",
            "\r\n",
            "\r\nА цезиевая бомба, точнее — источник гамма-излучения в виде изотопа цезия-137, помещенного в капсулу с излучающим окошком и смонтированного в аппарате радиотерапии, в течение четырех месяцев пылилась в покинутом здании, пока ее не свинтили оттуда двое друзей-мародеров. Тем же вечером они приступили к разборке подвижной головки прибора, откуда в конце концов ими была извлечена злополучная капсула. Немного поблевав, друзья разошлись по своим делам: Перейра все же обратился в госпиталь, где ему диагностировали пищевое отравление, а Алвес на следующий день продолжил разборку капсулы. Несмотря на полученные непонятные ожоги, 16 сентября он успешно проковырял в окошке капсулы отверстие и вынул на кончике отвертки странный светящийся порошок. Попытавшись его поджечь, он в дальнейшем потерял интерес к капсуле и продал ее на свалку человеку по имени Девейр Феррейра.",
            "\r\n",
            "\r\nНочью 18 сентября Феррейра увидел таинственный синий свет, исходящий от капсулы. Восхитившись невероятным феноменом, он тут же притащил столь замечательную вещь себе домой. Там он демонстрировал светящуюся капсулу своим родственникам и друзьям. Один из друзей 21 сентября доломал окошко капсулы, вытащив наружу несколько гранул вещества. Никто из них не знал, какой ящик Пандоры был ими взломан. Хлорид цезия-137 стал в буквальном смысле ходить по рукам.",
            "\r\n",
            "\r\n24 сентября брат Феррейры Айво утащил светящийся порошок к себе домой, рассыпав его на бетонный пол. Его шестилетняя дочь ползала по этому полу, жуя бутерброд и с восторгом обмазываясь необычным светящимся веществом…",
            "\r\n",
            "\r\nПараллельно с этим жена Феррейры Габриэла серьезно заболела. 25 сентября тот взял странную капсулу и перепродал ее на соседний разбор металлолома.",
            "\r\n",
            "\r\nОднако Габриэла оказалась настоящей героиней в этой истории. Уже получив смертельную дозу радиации в 5,7 Грей, она сопоставила свое заболевание, похожие недомогания у знакомых и странную вещь, принесенную мужем. 28 сентября она нашла в себе силы пойти на вторую свалку, вытащить злополучную капсулу и вместе с ней поехать в больницу. В больнице, конечно, пришли в ужас, быстро распознав назначение странной детали, но к счастью, женщина упаковала фонивший материал и заражение в больнице оказалось незначительным. Габриэла умерла 23 октября в один день с маленькой племянницей Феррейры. Кроме них умерли еще двое работников свалки, раскурочивших капсулу до конца.",
            "\r\n",
            "\r\nМАГАТЭ назвало инцидент в Гойянии самым кошмарным радиационным инцидентом в мире. Только по благоприятному стечению обстоятельств последствия оказались локальными, но потенциально они могли затронуть огромное количество людей в густонаселенном городе. Всего заражены оказались 249 человек, 42 здания, 14 машин, 3 куста, 5 свиней и 50000 рулонов туалетной бумаги. Власти вывезли с мест заражения верхний слой почвы и почистили территорию ионообменными реагентами. Маленькую дочь Айво пришлось хоронить в герметичном гробу под протесты местных жителей, не желавших захоронения ее радиоактивного тела на кладбище.",
            "\r\n",
            "\r\nВ том же году мальчик из Мичигана по имени Дэвид Хан получил на десятый день рождения том «The Golden Book of Chemistry Experiments», который сделает его одиозным авантюристом, ",
            ". Количество радиоактивных веществ, которое он наковырял из самых разных предметов, причем совершенно сознательно, поражает воображение. Торий, америций, тритий, радий и даже собственноручно собранный ядерный реактор из этих материалов — то, к чему он навязчиво стремился всю свою жизнь. ",
            "\r\n",
            "\r\nЭти примеры показывают, что на самом деле в нашем быту до сих пор остается множество различных предметов, которые могли раньше считаться вполне безопасными, либо считались безопасными в руках специалистов, но из этих рук пошли гулять по другим, либо по какой-то причине оказались заброшенными, украденными и так далее.",
            "\r\n",
            "\r\nВ принципе об этих предметах дает представление Интернет в виде обсуждений на специализированных форумах, зачастую ",
            " и с ",
            ". Но все же я решил более-менее классифицировать все те высокоэнергетические предметы, которые до сих пор в ходу в нашем мире, чтобы люди не слишком восхищались разного рода свечением, не брали в руки странные штуковины с окошками и не сдавали их на металлолом (наверное, вообще худшее, что можно сделать!).",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nТаким словосочетанием обозначается постоянно фосфоресцирующий состав, наносимый на все, что нужно видеть в темноте. До эры светодиодов, миниатюрных качественных лампочек и надежных элементов питания подсветить какую-нибудь шкалу прибора лампочкой было ненадежно. Куда как более дешево и безотказно действует светящаяся несколько десятилетий подряд краска. Достаточно нанести краску на стрелки аналоговых (а других и не было) приборов, выполнить ей деления шкал — и прибор становится читаемым днем и ночью. Самым, наверное, знакомым для людей моего поколения таким прибором является популярный советский компас Андрианова:",
            "\r\n",
            "\r\n",
            "\r\nНу а в целом, очень многие вещи военного назначения, «старой закалки», выполнялись с помощью радиоактивной краски. Часы, водолазные часы, шкалы с приборных досок военной техники. Все это выполнено светящейся зеленым краской на основе радия-226. В основном это все-таки касается авиации и флота, причем середины ХХ века. Поэтому если вы коллекционируете подобные предметы, восстанавливаете ретро-технику, помните: женщины, наносившие эту краску на стрелки приборов в военное время, страдали от серьезных проблем со здоровьем. Вам это не нужно.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nКонечно, такие количества краски, которую вы не наносите сами, а всего лишь наблюдаете уже на излете ее активности, дают минимальное излучение, но я вот как-то морщусь, вспоминая детский восторг от близко поднесенного к лицу фосфоресцирующего компаса. Ну а если краска уже облупляется, то дышать такими микрочастицами вообще точно не стоит.",
            "\r\n",
            "\r\nСегодня радиевая краска запрещена уже почти полвека, а в состав СПД теперь входит тритий. Он считается более безопасным, хотя и сложен в получении. Ежегодно производится около 400 г трития, причем стоимость доходит до $30000 за грамм.",
            "\r\n",
            "\r\n",
            "\r\nНеобязательно работать на урановых рудниках для облучения себя повышенным фоном. Обычные граниты тоже могут давать превышение естественного фона. Все зависит от конкретного состава минералов.",
            "\r\n",
            "\r\nВ России, на границе Иркутской области и Якутии, существует единственное в мире месторождение ",
            ". Квота на добычу этого камня установлена республикой Саха-Якутия всего в 100 тонн в год. Поэтому изделия из него постоянно дорожают. Однако помимо марганца, дающего характерную окраску, в жилах могут содержаться примеси редкоземельных элементов и тория. Эти примеси могут давать сырью существенный фон. ",
            "\r\nМаловероятно, но не исключено, что изделие из такого камня окажется неприятным источником излучения.",
            "\r\n",
            "\r\nСуществуют, однако, гораздо более популярные, ныне уже не выпускаемые по объективным причинам, но все еще ходящие по рукам коллекционеров бытовые предметы из уранового стекла — вполне говорящее название, правда? Оно изготавливалось добавлением в стекло оксидов урана или ураната натрия. Помимо красивого зеленого цвета, предметы, отлитые из него, могут также испускать великолепное зеленое свечение под действием ультрафиолета. Изделия, изготовленные в СССР, обычно матово-зеленые либо коричневые, а сделанные в Европе — полупрозрачные, и называются на американском английском vaseline glass.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nВы вполне можете вбить это словосочетание в поиске на ebay, и получите множество симпатичных и забавных сувениров из этого материала, испускающего множество быстрых и веселых бета-частиц. Энергия такого излучения невысока, но лучше любоваться этими вещами из-за стекла, а не держать на обеденном столе.",
            "\r\n",
            "\r\n",
            " ",
            "\r\n",
            "\r\n",
            "\r\nТакже вам могут встретиться в жизни некоторые неприятные торированные предметы. Упоминавшийся «Радиоактивный Бойскаут» активно (извините за каламбур) использовал в своих опытах калильные сетки туристических ламп. Удобная вещь, умеющая превращать нагревание топливом в свет посредством эффекта кандолюминесценции — переизлучения тепла в видимый спектр. Уже не выпускаются, но все еще продаются. Химик Карл Ауэр фон Вельсбах установил а начале ХХ века, что оптимальным составом для калильных сеток является 99% тория к 1% церия. Очень малоприятный состав, да еще для раскаленного добела сплава.",
            "\r\n",
            "\r\nТорий могут также содержать некоторые вольфрамовые электроды. Если когда-либо придется с такими работать — обратите внимание на красную маркировку, и имейте в виду, что часть перегретого при сварке материала испаряется.",
            "\r\n",
            "\r\n",
            "\r\nОтдельная проблема с торием лежит в области раритетной фототехники. Существует большое количество моделей старых объективов с торированной оптикой. Торирование использовалось в качестве ",
            " до 1970-х годов. ",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЕсли все предыдущее было недоразумением технологий первой половины XX века, когда еще не такое большое значение придавали радиоактивности предметов, то следующие устройства представляют серьезнейшую опасность и по идее вообще не должны попадаться вам в быту и вообще в какие-либо не те руки. Это — штатные источники излучения, находящиеся в специальных приборах и устройствах. Если вы нашли что-то подобное и не умеете с ним обращаться — вызывайте МЧС и не дожидайтесь наступления вашего персонального Чернобыля.",
            "\r\n",
            "\r\nГамма-источники используются в качестве уровнемеров в каменоломнях и карьерах, в гамма-дефектоскопии и прочей промышленности.",
            "\r\n",
            "\r\n",
            "\r\nСходный принцип действия с уровнемерами и у датчиков дыма. Радиоактивный источник постоянно облучает датчик напротив. Дым (твердые частицы) ослабляет поток, что замечается датчиком, и включается тревога. В датчиках дыма используется изотоп америция-241, хотя в старых советских РИД-1 применялся аж плутоний-239. Разбирать их или тем более выкидывать в мусор крайне не рекомендуется.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nИ снова тот же самый принцип. Есть толщина чего-то, которая перекрывает путь ионизирующему излучению. На ",
            " табло загорается тревожная лампочка: «обледенение». На фото — датчик обледенения РИО-3, на отечественной авиации получил широкое распространение, поэтому вполне может внезапно встретиться на заброшенных аэродромах, военных базах тем, кто залезет туда посталкерить, с плачевными последствиями: ",
            "\r\n",
            "\r\n",
            "\r\nДопустим, прочитав эту статью, вы запаниковали и побежали ",
            " покупать недорогой и сердитый армейский или геологический дозиметр на Авито. Тем самым вы приобретаете и невзрачный, маленький, но совсем не безобидный контрольный источник, для калибровки прибора:",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЭто тоже радиоактивный источник, вполне серьезный и опасный для здоровья, несмотря на свою миниатюрность. Его нельзя терять, ломать, давить или выкидывать.",
            "\r\n",
            "\r\nЕсли вы думаете, что целью статьи было показать, как страшно жить — вовсе нет. Попробуйте посмотреть на это с другой стороны: вы предупреждены, и теперь не будете покупать для своих проектов на ардуино стильные аналоговые циферблаты от авиационных и флотских приборных панелей, поостережетесь сваривать ториевыми электродами и фотографировать на просветленный винтажный объектив. И тем более, чтобы заработать на все это денег — не потащите в металлолом найденный на каком-то заброшенном заводе пузатый гамма-источник с проушиной сверху."
        ],
        "title": "Радиоактивные предметы среди нас"
    },
    {
        "images": [
            "https://habrastorage.org/webt/hh/o3/lw/hho3lwehvgqwntfcr-p5qwnpgvg.png"
        ],
        "text": [
            "\r\n",
            "\r\nЭто еще один пост из постоянной рубрики «фриланс vs. офис». На разных фриланс тусовках, да и стоящие рядышком удаленщики, все чаще говорят о том, что работа переезжает на «удаленные рельсы». Эта знаменитая фраза — «Лучшие разработчики живут не в Сан-Франциско, а по всему миру». Проекты с полностью удаленными командами вроде basecamp. В целом рост бирж за последнии несколько лет в разы — наводят на мысль, что удаленка и фриланс — это зарождение клондайка.",
            "\r\n",
            "\r\nРазвалившись в гамаке, на берегу острова Бора Бора, ты неспешно рисуешь скетч или отрабатываешь навыки js-ниндзя.",
            "\r\n",
            "\r\nВ левой руке махито, в правой мулат(ка). И основным обременяющим занятием есть поход к банкомату.",
            "\r\n",
            "\r\nМожет так и бывает, но уж точно не у меня. Поэтому, проработав 12 лет на фрилансе (около 11,000 часов), внезапно, я задумался — а что дальше? А почему я топчусь на месте то. Пусть у единиц, но получается расти дальше, расширять базу клиентов, основывать компании, интересно жить в конце концов.",
            "\r\n",
            "\r\nПоэтому этот пост с СЕО-шным названием будет именно о том, что не так во фрилансе со «своей колокольни». Во-первых самоанализа ради. А во-вторых для того парня из офиса, который мылится работать на себя, да все никак… За 12 лет много опыта накопилось, есть чем поделиться. Много примеров из опыта.",
            "\r\n",
            "\r\n ",
            "\r\nНачало во фрилансе — это такая лотерея, с элементами унижений, отчаяния, возможно разбитых надежд. Я конечно драматизирую, в контексте тех хитрых ребят, которые увели чьего-то заказчика или нашли его на стороне и привели на Upwork. Да, кстати, речь в этом посте пойдет именно про биржу Upwork, если не указано обратное. Именно на ней я провел 12 лет с перерывами.",
            "\r\n",
            "\r\nТак вот, очевидный момент. Если у тебя голый профайл и нет отзывов о прошлых работах — то искать тебе и искать эту долгожданную работенку на 50$. Не верите? Вот только был случай. Нанимал ребят iOS и Android разрабов. Сделали довольно хорошо часть программы, за которую я получил 1200$, их же интересовал только фидбек. Не хвальбы ради, а скорее для подтверждения факта, насколько важна репутация и опыт во фрилансе. ",
            "\r\n",
            "\r\nПосему начинать всегда тяжело. Демпинговать, спамить, «просить звездочку», нескончаемые доделки переделки — все это обязательный атрибут первых заказов на фрилансе.",
            "\r\n",
            "\r\nДа, если ты студент, и качаешь например Ruby, то почему бы не покачать. А вот если войти-вайтишник, с ярым желанием заработать — то будет не просто.",
            "\r\n",
            "\r\nУ меня история с фрилансом началась в 2006 году, когда не было еще толпы индусов, а биржа называлась oDesk. Я был студеном (не голодным), дал объявление в газету! Меня нашел какой-то местный фрилансер и заверте…",
            "\r\n",
            "\r\nПо 6$/час я с большой радостью писал программки американским студентам, а не своим. Потом попался крупный клиент и мы дружно переехали с agency, на мой индивидуальный профайл, чтоб не платить посреднику. ",
            "\r\n",
            "\r\n",
            "\r\nКак правило неадекват. Ясно понимая, что все козыри у него распиханы по рукавам, как то — твой первый отзыв, первый заработанный доллар, да и вообще все в первой. Этот парень будет выжимать тебя, как спелый лимон. И вряд ли у тебя будет много контраргументов, вроде распальцевки — «this is extra» или «this is impossible». За пол дня будь добр сделай.",
            "\r\n",
            "\r\nДа, да. Вы скажете — надо знать себе цену, показать черный пояс по Ангуляр, но мы же говорим о недостатках. И поверьте моему опыту заказчика — довольно легко требовать работу с новичка, за минимум платы и максимум эфорта. Это бизнес.",
            "\r\n",
            "\r\n",
            "\r\nСлез с дивана. Взял ноут. Залез на диван. За стенкой — 3 воющие сирены в виде малышей и жены. Сверху перфоратор.",
            "\r\n",
            "\r\nТак и заснул на диване, ничего не сделав…",
            "\r\n",
            "\r\nДисциплина — это первое, чему нужно научится фрилансеру. Сюда же входит режим, питание, прогулки, время на себя, итд., итп.",
            "\r\n",
            "\r\nШалтай-балтай — не получится. Все таки не Шон Паркер. И надо руку держать на пульсе (телефоне) все время. Ребята из бизнеса не очень любят, когда им не отвечают.",
            "\r\n",
            "\r\n",
            "\r\nВ продолжении предыдущего пункта — режим, слово довольно размытое для фрилансера. Это вам не 9-18 и суббота выходной. ",
            "\r\n",
            "\r\nЭто 24/7, без выходных и праздников. Опять могу преувеличивать, но если вы хотите быстро подняться, придется работать как владелец бизнеса, то бишь все время за пультом. Это спустя время, можно перебирать харчами, и выбрать себе одного европейца парт-тайм, одного лояльного американца, который чтит все праздники и выходные на Руси. А по началу вигвам.",
            "\r\n",
            "\r\n",
            "\r\nМогут кинуть. Куда ж без этого. Справедливости ради скажу, что со мной это происходило один или два раза из около 60 проектов. Суммы небольшие, но очень неприятно, когда стараешься — а клиент пропадает с твоей работой.",
            "\r\n",
            "\r\nЗападло номер два — программы-трекеры. Не поесть, не пописать. Все время держит в напряжении, вырабатывая какую-то неведомую привычку «побольше-высидеть-часов». Бывали случаи у знакомых, когда после 15-часовых марафонов под трекером — они слышали Европу+ из раковины. А некоторым казалось, что за ними следят на улице. Со мной такого не было — но голова болела знатно, уже после 6 часов непрерывного кодинга.",
            "\r\n",
            "\r\nКак альтернативу почасовке, Бог придумал fixed-price с escrow. Скажем так. Слово escrow, то бишь гарантия выплаты, работает только до обращения клиента в сапорт с просьбой вернуть деньги. Ко всему прочему, выбивать по 300-500-1000 долларов, надо еще уметь, то бишь обосновать. В этом плане почасовка проще в плане разговоров о деньгах с клиентом.",
            "\r\n",
            "\r\nНу и самая мякотка — это когда можно добавлять потраченное время в ручную. Так работает большинство крупных контор в офисе, также можно и договорится с человеком, когда есть ",
            ". Со временем уже фрилансер диктует условия.",
            "\r\n",
            "\r\n",
            "\r\nЕго нет. Только не надо пожалуйста про коворкинги или снять хату с корешами. Сам молча стучишь по клаве до выпученных глаз. Никто не мешает сходить в группы Анонимных Алкоголиков, поговорить? Хмм… это смотря как работать. Обычно к концу дня желание одно — лечь и потупить. Фриланс — это не печеньки. Фриланс — это не настолки и тренажерка внизу. Фриланс — это сколько отработал — столько получил. Поэтому здесь 8-10 часов по нагрузке сравнимо с 2-3 днями в офисе.",
            "\r\nНе забудьте про трекер.",
            "\r\n",
            "\r\nА как же друзья, семья, знакомые? Ну что я вам скажу. Если друзья фрилансеры — то ситуация примерно такая же. Ваше общение потихоньку переходит в скайп-чатик, и на этом дружба заканчивается. Семья, знаете ли, каждый занят своим делом.",
            "\r\n",
            "\r\nА папа — приставка для компьютера. Чего его беспокоить? Вот и получается раз в квартал собираемся.",
            "\r\n",
            "\r\nНа всяких ивентах, со знакомыми, чаще чувствуешь себя белой вороной, нежели приобщенным к делу индивидом.",
            "\r\n",
            "\r\nТут у людей карьерный рост, обсуждение политики и селебрети. А тебе оно зачем? У тебя же есть трекер… и IDE. ",
            "\r\n",
            "\r\n",
            "\r\nВ дополнение к предыдущему. Она атрофируется. Если вы конечно не продажник на удаленке — то фрилансер медленно, но верно выпадает из общества. Люди разные, кто-то выбирает одиночество, кто-то жить не может без людей, но справедливо, что выбирая фриланс — вы сознательно замыкаетесь в себе. Контакты с людьми все реже. Какие-то жизненные мелочи, вроде",
            "\r\nпохода в кино — становятся бессмысленными. Тебя некому пушить!",
            "\r\n",
            "\r\nУ них же как ведь? — Один побёг и айда за мной! — «А мартышка смотрит, мартышка повторяет», вот так и получается.",
            "\r\n",
            "\r\nТо же занятие спортом. Ты уже взрослый дядя, видишь, что здоровьечко то надо поддерживать, нагружать себя. — А ты поди себя заставь, вот просто так, регулярно ходить в спортзал. Дошло до того, что я организовал спортзал дома. Но мотивация соответствующая. ",
            "\r\n",
            "\r\n",
            "\r\n… Пенсионный фонд. Тут все как в этой песне. Работая недолгое время в компании, у меня было официальное место работы, мед.страховка, абонементы в фитнес клуб и библиотеку. Разумеется железо для работы, которое по щелчку могли поменять на любое другое.",
            "\r\n",
            "\r\nНе скажу, что на фрилансе, отсутствие «печенек» меня сильно напрягает — зато свобода…",
            "\r\n",
            "\r\n",
            "\r\nПару слов о свободе. Люди, которые далеки от фриланса, думают, что мол куда захотел — туда пошел. Взял ноут, сел на самолет и йухууу! ",
            "\r\n",
            "\r\nНу во-первых ноут — это может копирайтеру хватит. А мне нужен мощный комп, 2 монитора и макбук для тестов. Плюс быстрый инет.",
            "\r\n",
            "\r\nИ второе заблуждение по поводу свободы. Да, хоть ты и не сидишь в кубикле целый день, но клиенты виртуально держат за кокосы, постоянно теребя мессенджер. В свою очередь — не ответить довольно проблематично. А клиенты из разных таймзон. И вот ты в 2 часа тестируешь софт, на рассвете воскресенья деплоишь в прод, а посреди недели тебе пишут 3 человека синхронно, что у них дедлайн. Такая гипертрофированная свобода.",
            "\r\n",
            "\r\n",
            "\r\nНемного о здоровье. Дело в том, что лайфстайл фрилансера подразумевает полную свободу действий. Да, это противоречит пункту выше, но вас в любом случае никто и ничего не сдерживает, например напиться до поросячьего визга посреди недели.",
            "\r\n",
            "\r\nТакая разнузданность приводит к ",
            "со временем. ",
            "\r\n",
            "\r\nТо бишь запросто можно развлекать себя бутылкой, чуть ли не каждый день. С работы не выгонят. Деньги как правило есть.",
            "\r\n",
            "\r\nНу и в довесок малоподвижный образ жизни может превратить фрилансера в развалину еще до 40-ка.",
            "\r\n",
            "\r\n",
            "\r\nПожалуй на этом можно закончить список недостатков фриланса. Обладая критическим и/или креативным мышлением — все эти грабли обходятся. Мое дело было поделиться опытом и возможно снять с кого-то розовые очки.",
            "\r\n",
            "\r\nДля баланса во Вселенной, следующей планирую статью — Как стать успешным фрилансером."
        ],
        "title": "Недостатки фриланса. Личный опыт"
    },
    {
        "images": [
            "https://habrastorage.org/webt/gu/vz/oq/guvzoqlpb3qduekyvm9bizshkei.jpeg",
            "https://habrastorage.org/getpro/habr/post_images/262/638/2ff/2626382ff2361657d315ea078a68adc7.jpg",
            "https://habrastorage.org/webt/7d/ml/l3/7dmll3dtf1utn2q-hddwgy0qcyy.jpeg",
            "https://habrastorage.org/webt/ts/az/v2/tsazv2v4xrksv8qzowhlzdxh1ye.jpeg"
        ],
        "text": [
            "\r\n",
            "\r\nЭто продолжение истории советской межпланетной станции, что снова к нам вернется. Начало ",
            ".",
            "\r\n",
            "\r\nЧем мне нравятся подобные дискуссии, так это тем, что при мозговом штурме можно многое уточнить. И новая информация действительно интересная.",
            "\r\n",
            "\r\n Для начала, Игорь Лисов (обозреватель журнала «Новости Космонавтики») верно указал на то, что в прошлой статье я не проанализировал судьбу всех объектов, что оказались в космосе в 1972 году. Я процитирую его анализ полностью:",
            "\r\n ",
            "\r\n",
            "\r\n",
            "\r\nС первыми объектами мы, по сути, разбирались в прошлой статье. Замечание про разгонный блок тоже логичное. Действительно, после завершения работы блока «Л» он должен был отделиться от межпланетной станции и сойти с орбиты, так как был очень легким/громоздким.",
            "\r\n",
            "\r\nГораздо интереснее появление объекта 6073. Первая TLEшка на него (что я нашел) датируется 5 июля. Через три месяца после запуска станции. Это достаточно близко к дате достижения станцией Венеры, если бы она вышла на межпланетную траекторию. Ее близнец, «Венера-8», вошла в атмосферу Венеры 22 июля.",
            "\r\n",
            "\r\nЕсли предположить, что станция все это время работала (почему бы и нет?), находясь в солнечной ориентации, то также можно предположить, что в автоматике станции подобное разделение было прописано, как реакция на прекращение работоспособности перелетного блока. Например, окончания запасов азота для ориентации. Режим работы на орбите Земли должен отличатся от межпланетного, и азот уходит куда быстрее.",
            "\r\n",
            "\r\nНо это только версия. Тем более что есть информация, противоречащая ей. На сайте Анатоля Зака есть снимок станции, что передал ему астрофотограф Ральф Вандерберг в 2011 году.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nИ по нему выходит, что станция все-таки не разделилась.",
            "\r\n",
            "\r\nВпрочем, лично мне анализ Игоря Лисова кажется более логичным. Он подкреплен баллистическими коэффициентами и оценкой яркости. Есть информация, что яркость объекта слабо меняется от фазы. Что подтверждает версию о шаре. Но тогда не ясно, что сфотографировал Ральф.",
            "\r\n",
            "\r\nКонечно, это все мало меняет именно для нас. Мы и так ждали возвращение спускаемого аппарата. Он сейчас и летает в космосе. Ситуация может измениться только относительно времени его возвращения. Спускаемый аппарат одновременно тяжелый и компактный. Такие слабо тормозятся об атмосферу. Я вел прошлую оценку исходя из мнения, что станция может пережить следующий пик солнечной активности только после заметного падения апогея. После которого долго не пролетает. Спускаемый аппарат может дотянуть и до следующего пика. То есть время его жизни может увеличиться еще на 11 лет. Дальше уже вряд ли.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nТем не менее, в истории со станцией есть определенная недосказанность. На момент прошлой статьи я работал в архиве, и хоть основной целью была Луна, заказал и несколько подшивок документов, посвященных исследованию Венеры. Честно скажу, целью был поиск документов, в которых пояснялось, что случилось с разгонным блоком. Должны же были тогда разобраться, почему он выключился раньше времени! Увы. Именно этого я не нашел. В архиве оказалось только техническое задание на станцию В-72, два отчета с заседания госкомиссии и одно испытание парашюта станции. Их я вынес в ссылку в конце статьи. Документы оказались интересными хотя бы тем, что отвечают на часть вопросов, что задавали о посадке станции. А именно:",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nНет. Возможно, так и будет. Мало ли, что произошло с ним за эти годы. Но если оценивать исключительно по техническому заданию, лично я нахожу это маловероятным.",
            "\r\n",
            "\r\nВот цитата из ТЗ:",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nДаже при 70 атм расчетные перегрузки были 100 g. При одной атмосфере они должны быть заметно выше. При том, что посадка на утрамбованный песок и для Земли допустимое условие.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЗдесь, к сожалению, плохие новости. Точнее я не могу сказать, какой там применен датчик. В ТЗ это не описывалось. Только отметили, что механизм отстрела крышки парашютного контейнера изменен. В венерианской атмосфере парашют выходил на высоте 64 км от поверхности Венеры. Это около 0.1атм, что соответствует 16 км от поверхности Земли. То есть, если бы он вышел, высота была бы достаточная для торможения. ",
            "\r\n",
            "\r\nТеперь ложка дегтя. Мною был обнаружен отчет с испытанием парашюта. ",
            "\r\n",
            "\r\nЕсли быть кратким, то при нагреве парашюта со станций В-72 было обнаружено, что при высоких температурах он начинает гореть и превращаться в стекловидную массу с низкой прочностью. Что, конечно, было бы катастрофой. Но было выяснено, что в постановке эксперимента – ошибка, и подобный процесс происходит только в кислородной атмосфере. В углекислой атмосфере Венеры никакого окисления не происходит, и парашют не теряет свою прочность. ",
            "\r\n",
            "\r\nДругими, словами в нашей атмосфере из-за высокой температуры, полученной при входе в атмосферу, парашют может начать окисляться, а при окислении выделятся еще больше энергии. Теплозащита станции должна выдержать, а вот парашют превратится в стекловидную массу. Увы, даже если там некий механический датчик, то даже при его срабатывании уже может быть нечего выпускать.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nСейчас — конечно. Но когда спускаемый аппарат будет накручивать последние витки вокруг Земли, ситуация сильно изменится. Для начала, вход в атмосферу произойдет в районе перигея. Долготу точки входа можно будет понять по координатам долготы восходящего узла. В целом, предсказать последние витки аппарата можно будет уже по TLEшкам. И, соответственно, выдать координаты входа в атмосферу для нескольких следующих витков. Спускаемый аппарат сферический — аэродинамического качества нет. Из-за чего координаты посадки будут просто немного смещены относительно точки входа, по направлению витка.",
            "\r\n",
            "\r\nТак что будем ждать.",
            "\r\n",
            "\r\nМатериалы 72 года я вынес в отдельную ",
            "."
        ],
        "title": "Возвращение советской станции. Анализ и документы"
    },
    {
        "images": [],
        "text": [
            "Возможно, многие из старожилов помнят эпидемию статей с заголовками вида \"%something% в 30 строк JS\". А также последовавший за ней эпичный пост \"",
            "\", после которого эпидемия резко сошла на нет. Полностью осознавая, что этот шедевр мне никогда не превзойти, я всё же спустя пять лет решил докинуть свои пять копеек.",
            "\r\n",
            "\r\nДамы и господа, вашему вниманию предлагается игра «Крестики-нолики» в нуль строк JS, а также, в отличие от игры, упомянутой выше, в нуль строк CSS (включая инлайн стили). Только голый HTML, только хардкор.",
            "\r\n",
            "\r\n",
            "\r\n→ ",
            "\r\n",
            "\r\nВыглядит неказисто, зато будет работать в любом браузере. Под катом я расскажу, почему игра без JS оказалась в рубрике «Пятничный JS», а также другие грязные подробности. Впрочем, Америку я никому не открою, если вы опытный кодер, можете под кат даже не заходить",
            "\r\n",
            "\r\nСобственно, всё устроено очень тупо. Игра состоит из почти 6 тысяч страниц статического HTML, ссылающихся друг на друга. При тыке на клетку игрового поля происходит переход на страницу, где ход в эту клетку уже сделан. Очевидно, писать 6к страниц руками — удовольствие ниже среднего. Поэтому (сюрприз!) страницы генерируются JS-скриптами с помощью NodeJS. ",
            "\r\n",
            "\r\n",
            "\r\nСначала мы строим так называемое дерево игры — совокупность всех возможных игровых состояний и переходов между ними. Начальное состояние игры в моём коде представлено следующим образом:",
            "\r\n",
            "\r\n",
            "\r\nВ нём содержится информация о том, чей сейчас ход и каково состояние игрового поля. В будущем в нём также явится информация о том, какие ходы могут быть сделаны и к каким состояниям они приведут, а также некоторые другие приятные вещи.",
            "\r\n",
            "\r\nДальше мы начинаем, прошу прощения за тавтологию, с начального состояния и делаем следующее:",
            "\r\n",
            "\r\n",
            "\r\nНа самом деле мой код чуть сложнее, я по привычке развернул рекурсию в цикл, а вместо ссылок на другие состояния в ",
            " хранятся их строковые ключи в некоем ассоциативном массиве. Но это всё детали.",
            "\r\n",
            "\r\nЗатем из каждого объекта игрового состояния мы генерируем HTML-страницу. Пройдясь по объекту ",
            ", мы заполняем пустые клетки поля ссылками на страницы, соответствующие ходам, сделанным в эти клетки. Затем превращаем одномерный массив поля в двумерную HTML-таблицу. Добавляем всякие приятные мелочи вроде указания, который игрок ходит, и ссылки на начальную страницу — и вуаля!",
            "\r\n",
            "\r\nКроме режима, когда и крестики, и нолики ставятся человеком, в моём мега-инди-хите есть также возможность играть против железного мозга. Достигается это следующим образом:",
            "\r\n",
            "\r\n",
            "\r\nПо сходным принципам можно реализовать любую игру с не очень большим деревом. Впрочем, если я захочу подобным образом сделать шахматы, мне кажется, гитхаб откажется это хостить =)",
            "\r\n",
            "\r\nКстати о гитхабе: можете посмотреть там код целиком (ссылка присутствует на заглавной странице игры). На этом, в общем-то, всё. До свидания, девочки и мальчики. До новых встреч.",
            "\r\n",
            "\r\n",
            " Замена переносов строки с Windows-style на Unix-style — это очень долго, когда речь идёт о 6 тысячах файлов. Я пожалел, что не позаботился об этом на этапе написания кода, но всё-таки мужественно дотерпел до конца ",
            "."
        ],
        "title": "Пятничный JS: игра в 0 строк JS и CSS"
    },
    {
        "images": [
            "https://habrastorage.org/getpro/habr/post_images/656/ee4/2fe/656ee42fe767daa9c4720b24cfc43021.png"
        ],
        "text": [
            "\r\nНесколько лет назад я создал ",
            ", которые помещались в один твит. С тех пор Twitter удвоил длину твитов, поэтому я решил создать загрузочный компакт-диск. Он работает под управлением немного улучшенной версии tron.",
            "\r\n",
            "\r\n",
            "\r\nКод в твите создаёт загрузочный образ диска CD-ROM: ",
            ". Вы можете загрузить код в qemu или свою любимую виртуальную машину — и играть с помощью клавиш со стрелками. Вы даже можете записать iso на CD-R и загрузиться на реальном компьютере.",
            "\r\n",
            "\r\nЧтобы создать вручную образ CD, сначала нужно получить базовое представление об ",
            ". К сожалению, документы со стандартами ISO обычно дорого стоят. Однако ISO 9660 совпадает с ",
            ", так что спецификации можно прочитать бесплатно.",
            "\r\n",
            "\r\nУ ISO 9660 множество расширений, таких как UDF, El Torito, RockRidge, Joliet и др. Для загрузочных образов нам важен только ",
            ". Спецификация El Torito, на мой взгляд, плохо написана. Там есть ошибки (например, последняя строка в таблице 7), легко забыть, что значения шестнадцатеричные (не указаны префиксы ",
            "), цифры не отсортированы в интуитивном порядке и т.д. К счастью, документ совсем небольшой.",
            "\r\n",
            "\r\nЧтобы создать загрузочный диск, начинаем с записи 17 пустых секторов, за которыми следует набор дескрипторов томов (Volume Descriptor Set). Каждый сектор 2048 байт.",
            "\r\n",
            "\r\nПримечание. Спецификация ISO-9660 говорит, что Volume Descriptor Set начинается с сектора 16. Спецификация El Torito требует начало загрузочной записи в секторе 17. Технически, следует поместить фиктивный дескриптор тома в сектор 16, но и без него всё нормально работает.",
            "\r\n",
            "\r\nПишем первый дескриптор тома:",
            "\r\n",
            "\r\n",
            " ",
            "\r\nВ следующем секторе размещается Volume Descriptor Set Terminator:",
            "\r\n",
            "\r\n",
            "\r\nЗа дескрипторами томов следует загрузочный каталог (Boot Catalog). El Torito поддерживает разные режимы эмуляции. CD-ROM может эмулировать загрузочную дискету, загрузочный HDD и т.д. Я не устанавливал эмуляцию, то есть BIOS загрузит определённое количество секторов — и возьмёт наш загрузчик.",
            "\r\n",
            "\r\nКонтрольная сумма вычисляется так, что все 16-битные значения в записи суммируются до 0 (mod 65536).",
            "\r\n",
            "\r\nПервая запись в загрузочном каталоге (проверочная запись):",
            "\r\n",
            "\r\n",
            " ",
            "\r\nВторая запись (дефолтная):",
            "\r\n",
            "\r\n",
            " ",
            "\r\nПотом нули до конца сектора:",
            "\r\n",
            "\r\n",
            " ",
            "\r\nСледующий сектор — наш загрузчик и ретро-игра:",
            "\r\n",
            "\r\n",
            "\r\nЗатем я написал скрипт для компиляции загрузчика, сборки образа и генерации твита. Наконец, я прожёг CD и проверил, что ",
            "."
        ],
        "title": "Загрузочный CD и ретро-игра в одном твите"
    },
    {
        "images": [],
        "text": [
            "\r\n",
            "\r\nПри создании анимации всего лишь в 64 КБ сложно использовать готовые изображения. Мы не можем хранить их традиционным способом, потому что это недостаточно эффективно, даже если применять сжатие, например JPEG. Альтернативное решение заключается в процедурной генерации, то есть в написании кода, описывающего создание изображений во время выполнения программы. Нашей реализацией такого решения стал генератор текстур — фундаментальная часть нашего тулчейна. В этом посте мы расскажем, как разрабатывали и использовали его в ",
            ".",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nГенерация текстур стала одним из самых первых элементов нашей кодовой базы: в нашем первом интро ",
            " уже использовались процедурные текстуры. ",
            " состоял из набора функций, выполняющих заливку, фильтрацию, преобразования и комбинирование текстур, а также из одного большого цикла, обходящего все текстуры. Эти функции были написаны на чистом C++, но позже был добавлено взаимодействие C API, чтобы их можно было вычислять интерпретаторе C ",
            ". В то время мы использовали PicoC для того, чтобы снизить время, занимаемое каждой итерацией: так нам удавалось изменять и перезагружать текстуры в процессе выполнения программы. Переход на подмножество C был небольшой жертвой по сравнению с тем, что теперь мы могли менять код и видеть результат сразу, не заморачиваясь закрытием, перекомпиляцией и повторной загрузкой всего демо.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            " F – Felix’s workshop ",
            "\r\n",
            "\r\nКакое-то время мы исследовали возможности этого генератора, и в результате выложили его на веб-сервер с небольшим скриптом на PHP и простым веб-интерфейсом. Мы могли писать код текстур в текстовом поле, а скрипт передавал его в генератор, который затем сбрасывал результат как файл PNG для отображения на странице. Очень скоро мы начали делать наброски прямо на работе во время обеденного перерыва и делиться своими небольшими шедеврами с другими членами группы. Такое взаимодействие сильно мотивировало нас к творческому процессу.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nДолгое время генератор текстур почти не менялся; мы считали, что он хорош, и наша эффективность перестала повышаться. Но однажды мы обнаружили, что на Интернет-форумах есть множество ",
            ", демонстрирующих свои полностью процедурно сгенерированные текстуры, а также устраивающих ",
            " на разные темы. Процедурный контент когда-то был «фишкой» демо-сцены, но ",
            ", ",
            " и подобные им инструменты сделали его доступным для широкой публики. Мы не обращали на это внимания, и они начали с лёгкостью класть нас на лопатки. Неприемлемо!",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nНам давно уже нужно было пересмотреть свои инструменты. К счастью, многолетняя работа с одним и тем же генератором текстур позволила нам осознать его недостатки. Кроме того, наш зарождающийся генератор мешей тоже подсказал нам, как должен выглядеть конвейер процедурного контента.",
            "\r\n",
            "\r\nСамой важной архитектурной ошибкой была реализация генерирования как множества операций с объектами текстур. С точки зрения высокоуровневой перспективы это может быть и правильный подход, но с точки зрения реализации такие функции как ",
            " или ",
            " имеют серьёзные недостатки.",
            "\r\n",
            "\r\nВо-первых, ООП-стиль требует объявлять эти функции как часть API, какими бы простыми они ни были. Это серьёзная проблема, потому что она плохо масштабируется и, что более важно, создаёт ненужные трения в процессе творчества. Мы не хотели менять API каждый раз, когда нужно будет попробовать что-то новое. Это усложняет экспериментирование и ограничивает творческую свободу.",
            "\r\n",
            "\r\nВо-вторых, с точки зрения производительности такой подход требует обрабатывать в циклах данные текстур столько раз, сколько есть операций. Это бы не было особо важно, если бы эти операции были затратными относительно затрат доступа к большим фрагментам памяти, однако обычно это не так. За исключением совсем малой доли операций, например, генерация ",
            " или выполнение ",
            ", в основном они на самом деле очень просты и требуют всего несколько инструкций на точку текстуры. То есть мы обходили данные текстур для выполнения тривиальных операций, что чрезвычайно неэффективно с точки зрения кэширования.",
            "\r\n",
            "\r\nНовая структура решает эти проблемы благодаря реорганизации логики. Большинство функций на практике независимо выполняет одну и ту же операцию для каждого элемента текстуры. Поэтому вместо написания функции ",
            ", обходящей все элементы, мы можем написать ",
            ", где ",
            " работает только для отдельного элемента текстуры. Затем ",
            " можно написать в соответствии с конкретной текстурой.",
            "\r\n",
            "\r\nЭто кажется незначительным изменением. Однако такая структура упрощает API, делает код генерирования более гибким и выразительным, более дружественным к кэшу и с лёгкостью позволяет реализовать параллельную обработку. Многие из читателей уже поняли, что по сути это шейдер. Однако реализация по факту остаётся кодом C++, выполняемым в процессоре. Мы по-прежнему сохраняем возможность выполнять операции за пределами цикла, но используем этот вариант только при необходимости, например, выполняя свёртку.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nДля генерации текстур требуется время, и очевидный кандидат для снижения этого времени — параллельное выполнение кода. По крайней мере, можно научиться генерировать несколько текстур одновременно. Именно так мы сделали для ",
            ", и это очень снизило время загрузки.",
            "\r\n",
            "\r\nОднако это не экономит время там, где оно необходимо больше всего. По-прежнему много времени занимает генерирование одной текстуры. Это относится и к изменению, когда мы продолжаем перезагружать текстуру снова и снова перед каждой модификацией. Вместо этого лучше распараллелить внутренний код генерирования текстур. Поскольку теперь код по сути состоит из одной большой функции, применяемой в цикле к каждом текселу, параллелизация становится простой и эффективной. Снижаются затраты на эксперименты, настройку и наброски, что непосредственно влияет на творческий процесс.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЕсли это всё ещё не очевидно, то скажу, что генерирование текстур полностью выполняется в ЦП. Возможно, кто-то из вас сейчас читает эти строки и недоумевает «но почему?!». Кажется, что очевидным шагом является генерация текстур в видеопроцессоре. Для начала он на порядок увеличит скорость генерации. Так почему же мы его не используем?",
            "\r\n",
            "\r\nОсновная причина в том, что цель нашего небольшого редизайна заключалась в том, чтобы остаться на CPU. Переход на GPU означал бы гораздо больше работы. Нам бы пришлось решать дополнительные проблемы, для которых у нас пока недостаточно опыта. Работая с CPU, мы имеем чёткое понимание того, что хотим, и знаем, как исправить предыдущие ошибки.",
            "\r\n",
            "\r\nОднако хорошие новости заключаются в том, что благодаря новой структуре эксперименты с GPU теперь кажутся довольно тривиальными. Тестирование сочетаний обоих типов процессоров будет интересным экспериментом на будущее.",
            "\r\n",
            "\r\n",
            "\r\nЕщё одно ограничение старого дизайна заключалось в том, что текстура рассматривалась только как RGB-изображение. Если нам нужно было сгенерировать больше информации, допустим diffuse-текстуру и текстуру нормалей для той же поверхности, то ничего нам не мешало это сделать, но API особо и не помогал. Особенно важно это стало в контексте ",
            " (Physically Based Shading, PBR).",
            "\r\n",
            "\r\nВ традиционном конвейере без PBR обычно используют цветовые текстуры, в которые запечено множество информации. Такие текстуры часто представляют собой окончательный внешний вид поверхности: у них уже имеется некий объём, затемнены трещины, и на них могут быть даже отражения. Если одновременно используется несколько текстур, то для добавления карт нормалей или отражаемости поверхности обычно сочетаются детали крупного и мелкого масштабов.",
            "\r\n",
            "\r\nВ PBR-конвейере поверхности обычно используют наборы из нескольких текстур, представляющих физические значения, а не требуемый художественный результат. Диффузная цветовая текстура, которая ближе всего к тому, что часто называют «цветом» поверхности, обычно плоская и неинтересная. Цвет specular определяется коэффициентом преломления поверхности. БОльшая часть деталей и вариативности берётся из текстур нормалей и roughness (шероховатости) (которые кто-то может считать одним и тем же, но с двумя разными масштабами). Воспринимаемая отражающая способность поверхности становится следствием из уровня её roughness. На этом этапе логичнее будет думать с точки зрения не текстур, а материалов.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nНовая структура позволяет нам объявлять для текстур произвольные форматы пикселей. Сделав её частью API, мы позволяем ему заниматься всем boilerplate-кодом. После объявления формата пикселей мы можем сосредоточиться на творческом коде, не тратя лишних усилий на обработку этих данных. Во время выполнения он сгенерирует несколько текстур и прозрачным образом передаст их в GPU.",
            "\r\n",
            "\r\nВ некоторых PBR-конвейерах цвета diffuse и specular не передаются непосредственно. Вместо них используются параметры «base color» и «metalness», что имеет свои достоинства и недостатки. В ",
            " мы используем модель diffuse+specular, а материал обычно состоит из пяти слоёв:",
            "\r\n",
            "\r\n",
            "\r\nПри использовании информация об испускании света добавлялась непосредственно в шейдер. Нам не показалось необходимым наличие ambient occlusion, потому что в большинстве сцен вообще нет окружающего освещения. Однако не удивлюсь, что у нас появятся дополнительне слои или другие типы информации, например, анизотропия или непрозрачность.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nНа изображениях выше показан недавний эксперимент с генерацией локального ambient occlusion на основании высоты. Для каждого направления мы проходим заданное расстояние и сохраняем наибольший наклон (разность высот, поделенная на расстояние). Затем мы вычисляем occlusion из среднего наклона.",
            "\r\n",
            "\r\n",
            "\r\nКак видите, новая структура стала серьёзным улучшением по сравнению со старой. Кроме того, она поощряет творческую выразительность. Однако у неё всё равно есть ограничения, которые мы хотим устранить в будущем.",
            "\r\n",
            "\r\nНапример, хотя в этом интро проблем не возникало, мы заметили, что препятствием может стать выделение памяти. При генерации текстур используется один массив из значений float. При больших текстурах со множеством слоёв можно быстро прийти к проблеме с выделением памяти. Есть различные способы её решения, но все они имеют свои недостатки. Например, мы можем генерировать текстуры потайлово, при этом масштабируемость будет лучше, однако реализация некоторых операций, например свёртки, становится менее очевидной.",
            "\r\n",
            "\r\nКроме того, в этой статье, несмотря на использованное слово «материалы», мы говорили только о текстурах, но не о шейдерах. Однако применение материалов должно приводить и к шейдерам. Такое противоречие отражает ограничения существующей структуры: генерирование текстур и шейдинг — это две отдельные части, разделённые мостом. Мы пытались сделать так, чтобы этот мост пересечь было как можно проще, но на самом деле хотим, чтобы эти части стали единым. Например, если у материала есть и статические, и динамические параметры, то мы хотим описывать их в одном месте. Это сложная тема и мы пока не знаем, найдётся ли хорошее решение, но давайте не будем забегать вперёд.",
            "\r\n",
            "\r\n",
            "\r\n"
        ],
        "title": "Текстуры для 64k intro: как это делается сегодня"
    },
    {
        "images": [
            "https://habrastorage.org/getpro/habr/post_images/276/a02/0bd/276a020bdd33aac9241150f6339466e9.jpg",
            "https://habrastorage.org/getpro/habr/post_images/2d6/f35/717/2d6f35717db8a612e1163bcbd1db8c26.jpg",
            "https://habrastorage.org/getpro/habr/post_images/003/c57/a16/003c57a1627d602345c161a520ddeede.jpg",
            "https://habrastorage.org/getpro/habr/post_images/e11/a0c/365/e11a0c36554092f2fcbdae420cfb12ca.jpg",
            "https://habrastorage.org/getpro/habr/post_images/360/97c/aa7/36097caa7fc13150fbaf86d9f7a45c57.jpg",
            "https://habrastorage.org/getpro/habr/post_images/045/56f/22b/04556f22bf0780b38fcfec19ebeaf10b.jpg",
            "https://habrastorage.org/getpro/habr/post_images/225/9a0/668/2259a06683c97201e8d6fb12364e7f70.jpg",
            "https://habrastorage.org/getpro/habr/post_images/243/c71/3a6/243c713a6c83ea9f399d4946db452212.jpg",
            "https://habrastorage.org/getpro/habr/post_images/ab6/75b/5cb/ab675b5cb11bdbe69bab456888f56bc0.png",
            "https://habrastorage.org/getpro/habr/post_images/582/e5f/d7a/582e5fd7a425beeb23bcc43bc91e1691.jpg",
            "https://habrastorage.org/getpro/habr/post_images/b92/39a/f45/b9239af45d9323fa9c003fa37a68731c.jpg"
        ],
        "text": [
            "\r\n",
            "\r\n",
            "\r\nПочти все слышали о Большом взрыве. Но если попросить разных людей, от обывателей до космологов, закончить предложение: «Вначале было…», вы получите множество различных ответов. Один из наиболее распространённых – «сингулярность», то есть, момент, когда вся материя и энергия Вселенной сконцентрировались в одной точке. Температура, плотность и энергия были бы сколь угодно, бесконечно большими, и это могло совпадать с зарождением самого пространства и времени.",
            "\r\n",
            "\r\nНо эта картина не просто неверна, она уже лет 40, как устарела! Мы совершенно уверены в том, что с горячим Большим взрывом не было связано никакой сингулярности, и у пространства и времени могло вообще не быть момента зарождения. Вот, что нам известно, и откуда.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nСегодняшняя Вселенная заполнена галактиками во всех направлениях и на разных расстояниях. В среднем, чем дальше от нас галактика, тем быстрее она удаляется от нас. Это происходит не из-за реального движения галактик в локальном для них космосе; всему виной расширение самой ткани пространства.",
            "\r\n",
            "\r\nТакое предсказание было одним из необычных результатов, полученных из Общей теории относительности в 1922 году советским физиком ",
            ", которое потом было подтверждено в наблюдениях Эдвина Хаббла и других учёных в 1920-х. Это означает, что с течением времени материя Вселенной рассредоточивается и становится менее плотной, поскольку объём Вселенной увеличивается. Это также означает, что в прошлом Вселенная была плотнее, горячее и более однородной.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЭкстраполировав развитие назад во времени, вы начнёте замечать несколько важных изменений Вселенной. В частности:",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nКаждый шаг представляет Вселенную всё более молодую, маленькую, плотную и горячую. Продолжая экстраполяцию, мы увидим, что плотность и температура вырастает до бесконечных значений, в момент, когда вся материя и энергия Вселенной содержалась в одной точке: в сингулярности. Горячий Большой взрыв, как о нём думали изначально, представлял собой не просто горячее, плотное и расширяющееся состояние, но и тот момент, когда все законы физики переставали работать. Это было зарождение пространства и времени, способ заставить всю Вселенную внезапно появиться из ниоткуда. Это был изначальный акт творения: сингулярность, связываемая с Большим взрывом.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nОднако, если бы всё было именно так, и Вселенная в прошлом имела сколь угодно высокие температуры, у такого состояния было бы несколько явных признаков, которые можно было бы наблюдать и сегодня. В остаточном свечении Большого взрыва были бы температурные флуктуации огромных амплитуд. Видимые нами флуктуации были бы ограничены скоростью света, они появлялись бы только на масштабах, не больших ",
            ". Должны были остаться реликты космоса высоких энергий, такие, как магнитные монополи.",
            "\r\n",
            "\r\nИ всё же, флуктуации температуры не превышают 1/30 000, что в тысячи раз меньше, чем предсказывает сингулярный Большой взрыв. Флуктуации, превышающие горизонт, существуют, что надёжно подтверждено спутниками WMAP и Планк. А ограничения на существование магнитных монополей и других реликтов сверхвысоких энергий чрезвычайно сильны. Отсутствие признаков их наличия имеет серьёзные последствия: во Вселенной никогда не было сколь угодно высоких температур.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nДолжна быть какая-то граница. Мы не можем экстраполировать назад сколь угодно далеко, к горячему и плотному состоянию со сколь угодно большой температурой. Есть ограничение на то, как далеко мы можем зайти, и при этом правильно описать нашу Вселенную. В начале 1980-х появилась теория, по которой до того, как наша Вселенная была горячей, плотной, расширяющейся, охлаждающейся, и заполненной материей и излучением, она испытывала состояние инфляции. Наличие фазы ",
            " должно было означать, что Вселенная:",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nКогда инфляция заканчивается, она превращает энергию, присущую до этого самому пространству, в материю и излучение, что и порождает горячий Большой взрыв. Но это не приводит ко сколь угодно горячему Большому взрыву – только к такому, который достигает максимальной температуры в сотни раз меньшей, чем температура, способная породить сингулярность. Иначе говоря, она приводит к горячему Большому взрыву, возникающему из инфляционного состояния, а не из сингулярности.",
            "\r\n",
            "\r\nИнформация, существующая в нашей наблюдаемой части Вселенной, которую мы можем измерить, благодаря наличию к ней доступа, соответствует лишь последним 10",
            " секундам инфляции, и всему, что случилось после этого. Если вы захотите спросить, как долго длилась инфляция – мы не имеем понятия на это счёт. Она продолжалась, по крайней мере, немного дольше 10",
            " секунд, но продолжалась ли она немного дольше этого, сильно дольше, или шла бесконечное количество времени – это не просто неизвестно, это в принципе нельзя узнать.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЧто же породило инфляцию? На эту тему ведётся множество исследований и рассуждений, однако никто этого не знает. Не существует свидетельств, на которые можно было бы опереться, никаких наблюдений, которые можно было бы сделать, никаких экспериментов, которые можно было бы провести. Некоторые люди делают ошибочные заявления вроде:",
            "\r\n",
            "\r\nУ нас была теория сингулярности Большого взрыва, породившей горячую, плотную, расширяющуюся Вселенную, до того, как мы узнали об инфляции; инфляция представляет собой просто промежуточный этап. Поэтому, у нас получается следующее: сингулярность, инфляция, горячий Большой взрыв.",
            "\r\n",
            "\r\nЕсть множество графиков и картинок, созданных ведущими космологами, иллюстрирующих данный сценарий. Но это не означает, что он верен.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nЕсть очень серьёзные основания полагать, что это не так! Мы можем математически продемонстрировать невозможность появления инфляционного состояния из сингулярности. И вот, почему: пространство во время инфляции расширяется с экспоненциальной скоростью. Представьте себе, как работает экспонента: по прошествии определённого количества времени Вселенная удваивает размер. Пройдёт в два раза больше времени, она удвоится два раза, то есть станет в четыре раза больше. Подождите три таких промежутка времени, и она удвоится три раза, то есть станет в 8 раз больше. Подождите 10 или 100 таких отрезков времени, и эти удвоения сделают Вселенную в 2",
            " или 2",
            " раз больше.",
            "\r\n",
            "\r\nЧто означает, что если мы пойдём назад в прошлое на тот же отрезок времени, или в два, или в три, или в 10 или в 100 раз больший, Вселенная будет всё меньше и меньше, но никогда не достигнет нуля. Она, соответственно, будет составлять половину, четверть, 1/8, 2",
            ", 2",
            " от первоначального размера. Но не важно, как далеко во времени мы зайдём, мы никогда не придём к сингулярности.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nСреди космологов хорошо известна ",
            ", демонстрирующая неполноту прошлого инфляционного состояния. Это означает, что все частицы, существующие во Вселенной, испытывающей инфляцию, рано или поздно встретятся при экстраполяции назад по времени. Это, однако, не означает, что сингулярность обязательно существовала – просто инфляция не описывает всё, что происходило в истории Вселенной, например, её рождение. Нам также известно, что инфляция не может появиться из сингулярного состояния, поскольку испытывающий инфляцию участок всегда должен начинать с конечного размера.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nКаждый раз, когда вы видите диаграмму, статью или историю о «сингулярности большого взрыва» или ещё какой-то сингулярности, существовавшей до инфляции, знайте, что вы имеете дело с устаревшим мышлением. Идея о сингулярности Большого взрыва потеряла актуальность, как только мы поняли, что перед горячим и плотным состоянием Большого взрыва существовало другое состояние – космическая инфляция – которое подготовило и запустило Большой взрыв. В самом начале пространства и времени, возможно, могла существовать сингулярность, из которой появилась инфляция – но гарантий этого нет. В науке есть вещи, которые можно проверить, измерить, предсказать, подтвердить или опровергнуть – например, инфляция, породившая горячий Большой взрыв. Всё остальное – не более чем досужие домыслы.",
            "\r\n",
            "\r\n"
        ],
        "title": "Идея сингулярности перед Большим взрывом устарела"
    },
    {
        "images": [
            "https://habrastorage.org/getpro/habr/post_images/fbe/7db/e12/fbe7dbe1233f437868e6565a13cdf6ad.jpg"
        ],
        "text": [
            "\r\n",
            "\r\n",
            " После ",
            " соседи стрелка поражены, и рассказывают репортёрам, что он был хорошим и добрым человеком. Бывшие одноклассники и сослуживцы описывают его, как бомбу, готовую взорваться. Эксперты связывают последнюю тираду Трампа с разнузданным нарциссизмом, ранней деменцией, агрессивным отцом, макиавеллевской проницательностью – или с искренним стремлением человека ",
            "… Продемонстрируйте пример любого человеческого поведения, и мы найдём ему пяток здравых объяснений. Всё это основывается на предположении о том, что мы с достаточно большой степенью достоверности можем понять, что происходит в голове у другого человека. Это предположение психологи называют ",
            " (МПЧ; а также — понимание чужого сознания, теория намерений, теория сознания, теория разума…). Считается, что эта возможность воспринимать тот факт, что у других людей имеется своё, отдельное сознание, в котором содержатся потенциально другие мнения и верования, намерения и желания, является одной из исключительных когнитивных способностей, отличающих нас от других существ.",
            "\r\n",
            "\r\nТо, что у нас есть народная психологическая теория о других разумах, неудивительно. Мы по натуре любим анализировать личность, накладывать ограничения на поведение, восхищаться и ненавидеть. Мы с распростёртыми руками принимаем единомышленников и воюем с «белыми воронами». Чтение разума – социальный клей, пронизывающий практически всё наше повседневное межличностное общение. Пытаясь понять, склонен ли потенциальный покупатель пистолета к насилию, пациент психиатрической клиники к самоубийству, кандидат президенты к правдивым высказываниям, мы отдаёмся на милость наших суждений о других людях.",
            "\r\n",
            "\r\nСудьба демократии зависит от нашей возможности воспринимать и принимать различные точки зрения – однако практически повсеместное отсутствие разумных публичных обсуждений говорит о том, что это у нас редко получается. Мы обвиняем людей, имеющих другую точку зрения, в персональных недостатках, скрытой предвзятости, недостатке образования, культурной промывке мозгов и множестве других недостатков логики из разряда «если б они только знали». Но есть одна более простая и пугающая возможность. Что, если мы на самом деле просто не способны досконально разобраться в том, что у других на уме?",
            "\r\n",
            "\r\nДля начала, допустим невозможное – что мы можем выйти за пределы нашего сознания и посмотреть, как может работать МПЧ. Психолог представляет ребёнку двух кукол – Салли, у которой есть корзинка, и Энн, у которой есть коробка. Салли кладёт в свою корзинку шарик, а потом уходит из комнаты. Пока Салли не вернулась, Энн берёт шарик из корзинки, и прячет его в своей коробке. Салли возвращается в комнату. После этого ребёнку задают вопрос: где Салли будет искать шарик? Примерно к четырём годам большая часть детей начинает понимать, что Салли будет искать его в своей корзинке (где она оставила его), а не в коробке Энн. Эта универсальная способность детей проходить ",
            " подобного теста, при отсутствии у них аномалий развития мозга — например, аутизма – часто используется когнитивистами, как неопровержимое доказательство того, что человек способен узнавать мысли другого человека.",
            "\r\n",
            "\r\nЧтобы разобраться в этом ещё глубже, в последние годы нейробиологи придумали множество всяческих ",
            " о том, каким образом наш мозг способен на такое. Первый многообещающий механизм был описан в 1992 году, когда итальянский нейробиолог ",
            " и его коллеги ",
            ", что когда макаки-резус пытаются достать еду, например, арахис, у них активируются отдельные клетки в префронтальной моторной коре мозга. Те же клетки активируются, когда исследователь пытается достать арахис – пока макаки уверены в том, что это жест был произведён сознательно, и что экспериментатор планирует съесть этот орех. Поскольку одни и те же клетки активируются и при инициации действия, и при наблюдении за действием, их ",
            " «зеркальными нейронами»; а вся нейросеть называется «система зеркальных нейронов».",
            "\r\n",
            "\r\nПоскольку макаки проводили различие между тем, являлось ли целью жеста стремление съесть арахис или поиграть с ним, исследователи заявили, что система зеркальных нейронов способна определить намерение, и что макаки также способны понимать чужое сознание. В последующее десятилетие зеркальные нейроны назойливо расхваливали в качестве нейрологической основы эмпатии, сложных социальных взаимодействий, эволюции языка и культурного развития, характерного для современного человека. Невролог-бихевиорист ",
            " даже счёл возможным ",
            ", что «зеркальные нейроны сделают для психологии то же, что открытие ДНК сделало для биологии. Вооружившись знанием об этих нейронах, мы получаем основу понимания целого букета загадочных аспектов человеческого разума: эмпатии с „чтением мыслей“, имитационного обучения, и даже эволюции языка».",
            "\r\n",
            "\r\nВ итоге более рассудительные исследователи ",
            ", и скептики снизили накал чрезмерного приписывания этим нейронам удивительных свойств. Марко Йакобони, нейробиолог из Калифорнийского университета в Лос-Анджелесе, пионер работы с зеркальными нейронами, сказал, что система работала на базовом уровне распознавания простейших намерений и действий – примерно как мы могли бы сработать в игре в покер с высокими ставками. Вы собираетесь сделать ставку, и вдруг замечаете, что игрок слева готовится выдвинуть стопку своих фишек. Он может делать этот жест специально, чтобы отвлечь вас от какого-то аспекта игры. Возможно, он пытается отвлечь вас от своего тайного партнёра, игрока справа. Возможно, он пытается сымитировать подсказку, характерное поведение, выдающее намерение или ценность карт на руках игрока, чтобы в будущем использовать это против вас. К одному и тому же движению могут привести самые разные состояния разума. Понимание того, что вскоре ваш оппонент двинет ваши фишки вперёд, ничего не сообщает вам о цели, приводящей к этому движению.",
            "\r\n",
            "\r\nНо это не останавливало учёных от попыток доказать состоятельность теории разума. После коллапса теории зеркальных нейтронов на их место встали другие участки мозга. В своей ужасно популярной лекции на конференции TED 2009 года когнитивист Ребекка Сакс из MIT утверждает, что правый ",
            " (пВТУ) – участок мозга, расположенный непосредственно за правым ухом – «практически полностью специализирован. Он не занимается практически ничем, кроме размышлений о мыслях других людей. Различия в этом участке мозга могут объяснить различия в том, как взрослые люди могут думать о других людях и судить их».",
            "\r\n",
            "\r\nНо ещё нам известно, что пВТУ ",
            " входящими сигналами органов чувств, создавая стабильное физическое ощущение собственной личности в окружающем мире. ",
            " может нарушить работу пВТУ и вызвать классические ощущения выхода из собственного тела. Повреждение этого участка инсультом или опухолью может ",
            " к нарушению самоощущения и узнавания, или к параличу. Несмотря на это, ",
            " Джин Дисети, когнитивисту из Чикагского университета, правильно работающий пВТУ необходим нам для того, чтобы отличать себя от других людей.",
            "\r\n",
            "\r\nЭто довольно странный замкнутый круг: мы требуем от одного и того же участка мозга как создавать непротиворечивое ощущение своей личности, так и выходить за рамки этой системы отсчёта, чтобы получить свежий, непредвзятый взгляд на мысли других. Какое-то противоречие основам психологии.",
            "\r\n",
            "\r\nНесмотря на неадекватность этих лидирующих объяснений МПЧ в нейробиологии, нам всё ещё сложно отказаться от веры в то, что мы можем заглянуть в разум другого человека. Сакс начинает свою лекцию на TED с вопроса: «Почему нам так просто узнать мысли другого человека?» Для иллюстрации данной мысли она показывает две фотографии. На первой – мать, глядящая на её маленького ребёнка; на второй – подросток, прыгающий с высокой скалы в океан. «Вам практически не нужно никакой информации, только одна фотография незнакомца, чтобы догадаться о том, о чём думает эта мать или этот молодой человек».",
            "\r\n",
            "\r\nЯ смотрю на мать и вижу комбинацию из любви и благоговения. Но подумав минуту, я понимаю, что я просто собрал некие общие предположения о том, что объединяет людей, и поместил их в её разум. Я не могу узнать, волнуется ли она из-за того, что его отец может почувствовать себя обделённым из-за её неразделённого внимания к ребёнку, думает ли о том, когда его можно отдать в детский сад, или пытается запомнить это чувство безусловной любви, которая, как она подозревает, подвергнется испытанию после превращения её младенца в бунтующего подростка. Используя врождённые и приобретённые представления о человеческой природе, я могу представить себе её мысли в общем и универсальном случае, но не в частностях.",
            "\r\n",
            "\r\nФотография прыгающего со скалы мальчика также поднимает вопросы. Поскольку мне не встречалась научная литература о психическом состоянии ныряльщиков со скал, вместо неё я использую исследование самого знаменитого соло-скалолаза, ",
            ". ",
            ", как Хоннольд взбирается по вертикальной стене йосемитского пика высотой в 900 м без какой бы то ни было страховки – без верёвок, сеток и ремней. Спросите себя: испытывает ли Хоннольд сильное беспокойство и страх, когда смотрит на землю Йосемита, расположенную в сотнях метров внизу – или умеренное? Или вообще не испытывает? Спросите себя, насколько вы уверены в ответе, и откуда вы узнаете, правильный ли он.",
            "\r\n",
            "\r\nВ 2016 году нейробиолог Джейн Джозеф из Медицинского университета Южной Каролины ",
            " мозг Хоннольда с мозгом другого опытного скалолаза. Они находились в фМРТ сканере, когда им показывали последовательность из 200 фотографий, предположительно вызывающих беспокойство – обгорелые и деформировавшиеся трупы, увечные жертвы происшествий, рискованные горные маршруты. Контрольный скалолаз демонстрировал высокий уровень активности ",
            " – участка мозга, обычно активирующегося в моменты страха и беспокойства. Джозеф сообщила, что миндалина Хоннольда наоборот, оставалась совершенно тихой. Когда его спросили про фотографии, Хоннольд удивился. «Не могу сказать точно, но я воспринимал их совершенно безразлично», — сказал он. Даже фотографии «обгорелых детей и всего такого» не показались ему ничем особенным. «Это было похоже на музей редкостей».",
            "\r\n",
            "\r\nДжозеф считает, что фМРТ Хоннольда демонстрирует отсутствие нормального первичного отклика на опасность, как будто его выключатель страха стоит в положении «выкл». И всё же Хоннольд не считает себя бесстрашным. Он может вспомнить случаи, как связанные со скалолазанием, так и не связанные с ним, которые он считает страшными.",
            "\r\n",
            "\r\nИ мы подходим ко второй проблеме – наслоению языка на психические состояния. Хоннольд действует сознательно, и тщательно изучает все маршруты восхождений. Он охотно признаёт, что падение приведёт к смерти, и описывает эту перспективу, как страшную. Представляет ли этот факт когнитивное осознание опасности или ощущение эмоции, сказать невозможно. Учитывая, что миндалина Алекса не работает, его понятие «страшного» вряд ли совпадёт с тем типом страха, который испытывают другие смертные, стоя у окна небоскрёба, не говоря уже о высокой скале. Мысли о том, что может испытывать Хоннольд во время соло-восхождений напоминают мне о вопросе философа Томаса Нагеля, не имеющем ответа: «Как это – быть летучей мышью?»",
            "\r\n",
            "\r\nНельзя сказать, что мы вовсе не имеем представления о том, что происходит в голове другого человека. Мозг прекрасно умеет распознавать закономерности; мы обычно правильно предполагаем, что другие люди будут чувствовать печаль на похоронах, радость на первом дне рождения ребёнка и злость, когда их подрежут на шоссе. Часто мы оказываемся правы, считая, что другие люди чувствуют примерно то же, что и мы. Послушайте людей из аудитории TED, когда им показывают фото прыгающего со скалы –они будто сами испытывают страх, который должен испытывать прыгун. Но при этом, если у этого прыгуна миндалина не работает, как и у Хоннольда, такое впечатление будет совершенно неверным. Нерешаемая проблема состоит в том, что мы пытаемся представить себе психическое состояние, которого у нас никогда не было. Это всё равно, что пытаться представить себе оргазм, когда вы его ещё ни разу не испытывали.",
            "\r\n",
            "\r\nВозможно, я совершенно неправ, и мои теоретические возражения против МПЧ несостоятельны. Возможно, существует убедительное доказательство основной идеи МПЧ – что нам известны мнения, желания и стремления другого человека.",
            "\r\n",
            "\r\nНачнём с простейшего способа экспериментального изучения МПЧ – определения лжи. Если мы хорошо читаем мысли, мы наверняка можем стать прекрасными детекторами лжи. Но в ",
            " от 2006 года в Journal of Personality and Social Psychology было показано, что волонтёры-испытуемые лишь немного превысили статистическую погрешность, пытаясь определить, лжёт актёр или говорит правду (54%). Десятилетие спустя, несмотря на различные попытки улучшить распознавание лжи, Monitor on Psychology ",
            ", что «способность людей определять ложь не превышает по точности случайные догадки или подбрасывания монеты. Это открытие верно для всех типов людей – студентов, психологов, судей, рекрутеров и служителей закона».",
            "\r\n",
            "\r\nЕсли мы плохо определяем ложь, возможно, мы лучше справимся с предсказанием случаев жестокого поведения. В 1984 году American Journal of Psychiatry ",
            ", что способность психиатров и психологов предсказывать насилие сильно преувеличена. Даже в лучшем случае – когда человека, у которого уже проявлялись такие наклонности в нескольких случаях, всесторонне оценивали – предсказывая будущее насилие, психиатры и психологи ошибались в два раза чаще, чем выдавали верный диагноз. Тем не менее, в статье было упомянуто, что новые методологии могут улучшить процент успешных предсказаний.",
            "\r\n",
            "\r\nНе вышло. Тридцать лет спустя в обзорной статье в The British Medical Journal было ",
            ": «Даже после 30 лет разработок мнение о том, что насилие, риск сексуальных домогательств или криминального поведения можно предсказать, и большинстве случаев не имеет под собой оснований». Несмотря на то, что он участвовал в создании широко используемого инструмента для оценки риска насилия, психолог Стивен Харт из Университета Саймона Фрезера в Канаде, разделяет этот пессимизм. «Не существует инструмента, польза которого была бы подтверждена, для определения потенциальных стрелков в школах или массовых убийц. В жизни есть много случаев, в которых наша доказательная база оказывается неадекватной, и это один из них».",
            "\r\n",
            "\r\nТа же история с предсказанием самоубийств. Согласно ",
            " ",
            " мета-анализам: «За последние 40 лет не наблюдалось улучшений точности оценки риска самоубийства». Британский национальный институт здоровья и искусства ухода не рекомендует использовать «инструменты и шкалы оценки уровня риска самоубийства».",
            "\r\n",
            "\r\nВсе хорошие теории предсказывают что-либо. Рано или поздно им находятся доказательства. Если эксперты не могут сказать нам, кто проявит насилие, совершит самоубийство, или врёт — не пора ли пересмотреть наличие реальных, практических ограничений теории сознания?",
            "\r\n",
            "\r\nЯ упомянул разногласия по поводу зеркальных нейронов, чтобы подчеркнуть наличие в мозге нескольких низкоуровневых процессов, которые могут показаться высокоуровневыми функциями, но не являются ими. Подозреваю, что тест Салли-Энн и другие проверки МПЧ могут оказаться аналогичными примерами. Да, мы знаем, что у других людей есть сознание, желания и намерения, которые, вероятно, отличаются от наших. Но поставить себя на место другого человека – это далеко не то же самое, что чувствовать и думать, как другой человек. Я, возможно, могут встать на место Хоннольда, но не смогу заползти в его разум.",
            "\r\n",
            "\r\nСоздавая эту статью, я сам неохотно признаю приведённые мною же самим свидетельства. Не могу отделаться от внутреннего ощущения того, что в распознавании лжи есть нечто большее, чем было исследовано. С другой стороны, как заядлый игрок в покер, я признаю, что не особенно хорошо умею распознавать блеф, поэтому пытаюсь основывать свои решения на последовательности ставок игроков. И я не один. Учитывая неудачи МПЧ с предсказаниями, психологи всё больше обращаются к большим данным вместо отдельных разумов.",
            "\r\n",
            "\r\nИсследовательская группа под руководством Стефана Людвига в Вестминстерском университете в Лондоне разработала автоматизированное программное обеспечение для текстовой обработки, которое проанализировало более 8000 заявок на участие в конкурсе на награды на основе результатов деятельности компании. Они сравнили способность программы обнаруживать подлоги в тендерах против независимого расследования менеджерами счетов компании. Программа намного превзошла профессиональных бухгалтеров, достигнув 70% точности. Исследователи надеются, что их техника в конечном итоге научится обнаруживать обман во всем: от заявлений на визу до анкет знакомств.",
            "\r\n",
            "\r\nУчёные из Медицинского центра университета Вандербильта в Теннеси ",
            " по более чем 5000 пациентов с физическими признаками самостоятельно нанесённых повреждений или суицидальным мышлением. Собирая доступные безличностные данные по здравоохранению, такие, как возраст, пол, почтовый индекс, лекарства и предыдущие диагнозы, и без прямых интервью с пациентами, программа показала точность порядка 80-90% в предсказаниях попытки суицида в последующие два года, и точность в 92% в предсказании попытки суицида на следующей неделе. Оценивая вероятность суицида 12 695 случайно выбранных пациентов, попавших в госпиталь, и не имеющих истории попыток суицида, группа смогла показать даже более высокую предсказательную точность. С такими результатами неудивительно, что Facebook ввела собственную ИИ-систему для определения пользователей с высоким риском суицида.",
            "\r\n",
            "\r\nНедостатки МПЧ давно уже стали частью общественного мнения – особенно в области критики психиатрии. Но мы продолжаем настаивать на том, что проблема кроется в психиатрии и психиатрах, а не в самой идее о том, что мы можем узнать чувства и мысли другого человека. Для меня последней каплей, бесспорным приговором МПЧ стали недавние политические события – от неспособности оценить ядерные намерения и ход мыслей Ким Чен Ына до практически универсальной неспособности политических экспертов распознать сдерживаемую злость, страх и отвращение, кипящее в будущих сторонниках Трампа.",
            "\r\n",
            "\r\nДолжен признаться, сомнения по поводу МПЧ у меня появились в самом начале моей карьеры нейробиолога. Молодая женщина с Ямайки задушила свою 18-месячную дочь. Когда её отправили в психиатрическую лечебницу главного госпиталя Сан-Франциско, она напала на мычащую женщину с деменцией, прикованную к инвалидной коляске, и сломала ей шею до того, как охранники смогли вмешаться. Психиатр, назначенный судом, хотел узнать, есть ли у этого жестокого поведения неврологическая основа.",
            "\r\n",
            "\r\nЭта женщина оказалась совсем не такой, как я её себе представлял, читая её историю болезни. У неё была яркая улыбка, она легко смеялась и имела мелодичный акцент, поэтому она очень легко располагала к себе. Я не мог представить, чтобы она кому-то навредила, не говоря уже о собственном ребёнке. Как и ожидалось, часовое исследование не дало никаких намёков на причины её поведения. Перед тем, как уйти, я собрался с силами и спросил её, знает ли она, зачем задушила собственную дочь и напала на старуху.",
            "\r\n",
            "\r\nДолгое время она сидела без движения. Затем выпалила: «Ненавижу звуки плача». Она сложила ладони на бедре и смотрела на меня, покачивая головой. Мы оба потеряли дар речи, осознавая непреодолимую дистанцию между нами. Я был поражён, поняв, что любой мотив, который я приписал бы этой женщине, был бы чистой выдумкой, историей, которую я бы придумал, чтобы придать какой-то смысл необъяснимому.",
            "\r\n",
            "\r\nИ это был не единичный случай. В моей работе я достаточно часто оказывался сбитым с толку, чтобы признать, насколько мало доступа есть у меня к принципам работы чужого разума. Когда один пациент умер от загадочной болезни, я спросил у его 30-летнего сына разрешение на вскрытие. Он согласился при условии, что ему разрешат смотреть. Когда я спросил его, зачем, он сказал: «Это мой отец».",
            "\r\n",
            "\r\nЖенщина среднего возраста ночью потеряла сознание. Компьютерная томография показала массивное кровотечение в мозге, которое определённо привело бы к смерти через несколько часов. Когда я рассказал об этом её мужу, он пару раз моргнул, не выказывая никаких эмоций: «Хорошо. Я, наверно, поеду домой, приму душ».",
            "\r\n",
            "\r\nНо наиболее яркая демонстрация ограничений МПЧ произошла во время психиатрической части моего экзамена по нейробиологии на получение сертификата. Моим пробным пациентом был неухоженный человек, от которого пахло плесенью.",
            "\r\n",
            "\r\n — Как давно вы находитесь в больнице? – начал я интервью.",
            "\r\n — Три месяца.",
            "\r\nЯ удивился, что его не привели в порядок, и спросил снова.",
            "\r\n",
            "\r\n — Пару лет, плюс-минус. Тяжело следить за временем, когда ничего не происходит.",
            "\r\n — А вы не могли бы уточнить?",
            "\r\n — Если настаиваете, я бы сказал, что, скорее всего, нахожусь здесь три дня.",
            "\r\n — Есть у вас история психических заболеваний?",
            "\r\n — А у кого её нет?",
            "\r\n — У других членов семьи?",
            "\r\n — Зависит от точки зрения.",
            "\r\n — Вы знаете, почему вы здесь?",
            "\r\n — Нет. А вы?",
            "\r\n — Да. Вы мой пробный пациент психиатрической части моего экзамена по нейробиологии на получение сертификата. Мне бы реально помогло, если бы вы прямо отвечали на вопросы.",
            "\r\n — На личные вопросы прямо не ответишь. Сначала научишься отвечать да, нет, не знаю, а с другой стороны. Никогда не знаешь, когда тебя попросят выдвинуть кандидатуру для президентской гонки.",
            "\r\n",
            "\r\nИ так это продолжалось в течении 30 минут агонизирующей тряски головой, покачиваний и наклонов, пока оценивающий меня психиатр делал записи, а потом объявил, что время закончилось. Он разрешил пациенту уйти.",
            "\r\n",
            "\r\n — Ну как, — спросил экзаменатор. – Что думаете?",
            "\r\n — Понятия не имею. Пациент совершенно ненадёжный.",
            "\r\n — У вас наверняка есть подозрения.",
            "\r\n — Не особенно. Я даже не могу сказать, не издевался ли он надо мной.",
            "\r\n — Если бы удачное прохождение экзамена зависело от диагноза, что бы вы сказали?",
            "\r\n — Извините, это были бы просто догадки.",
            "\r\n — Вы свободны, — сказал психиатр, с отсутствующим выражением лица, которое я никак не смог интерпретировать.",
            "\r\n",
            "\r\nПосле экзамена я случайно встретился с психиатром. Он улыбался мне. «Неплохо – вы отлично справились».",
            "\r\n — Шутите? Я был уверен, что провалил психиатрию.",
            "\r\nОн рассмеялся.",
            "\r\n — Так что с ним такое? – спросил я.",
            "\r\n — Кто знает? Он у нас один из лучших, мы его используем для многих экзаменов в этой части страны.",
            "\r\n — Он профессиональный пациент?",
            "\r\n — Не совсем. До этого его помещали в больницу, хотя никто не мог с уверенностью сказать, что с ним не так. Находясь в лечебнице, он проявил удивительную способность имитировать большую часть психических заболеваний. На этот раз мы попросили его сыграть ненадёжного пациента, отказывающегося сотрудничать.",
            "\r\n — Так есть ли у него какое-то психическое заболевание?",
            "\r\nЭкзаменатор пожал плечами и улыбнулся.",
            "\r\n — Удачно вам долететь домой.",
            "\r\n",
            "\r\nЯ решил, что трагедия может вызвать реакции, в иных ситуациях невообразимые. Вряд ли это можно назвать чтением мыслей. Для того, чтобы по-другому взглянуть на мир, необходим редкий талант, требующий огромного воображения: Гамлет, мадам Бовари и Анна Каренина – не художественные уникумы, основанные на глубоком понимании, а лишь некие рассказы, которые мы накручиваем на стремления и мотивации других. Мы придумываем истории о наших супругах, детях, лидерах и врагах. Вдохновляющие истории помогают нам пережить тёмные ночи и трудные времена, но предсказания на основе обезличенных больших данных у нас всегда будут получаться лучше, чем на основе неверного представления о способности читать мысли другого человека."
        ],
        "title": "Понимание чужого сознания – это миф"
    },
    {
        "images": [
            "https://habrastorage.org/webt/vc/za/ep/vczaephxhgg4entua42pcfj4rxa.png",
            "https://habrastorage.org/webt/cz/oo/pw/czoopw-4xddmw5l5f9k9-obslpa.png"
        ],
        "text": [
            " Шёл сентябрь 2017 года, Apple вернули моду на чёлку, представив iPhone X. Неудивительно, что наши друзья из Китая, недолго думая, скопировали этот дизайн у Apple (хотя самая первая мини-чёлка была ещё в Essential Phone, который не взлетел). Но что мы видим сейчас? Huawei P20, Asus Zenfone 5, OnePlus 6, Motorola One Power, Xiaomi Redmi 6 и другие более-менее известные производители уже выпускают или анонсировали телефоны с чёлкой. Samsung и Google остались последними оплотами в этой ",
            " борьбе за безрамочность. Или нет? По слухам, Google Pixel 3 XL тоже будет ",
            " с изящным вырезом. Что ж, нам, как разработчикам, остаётся только оптимизировать свои приложения под этот вырез, чтобы пользователи смогли продолжать комфортно ими пользоваться. За подробностями прошу под кат.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nДля начала нам необходимо разобраться, нужна ли вообще оптимизация приложению?",
            "\r\nЕсли у вас fullscreen-приложение или в теме присутствуют ",
            ", то с большой вероятностью нужна.",
            "\r\n",
            "\r\nПрактически все приложения состоят далеко не из одного экрана, и можно не заметить, как на одном из них поедет вёрстка. Особенно если в приложении объёмный legacy code. Поэтому стоит всё-таки пройтись по всем основным экранам и перепроверить. Давайте разберёмся, что для этого нужно сделать.",
            "\r\n",
            "\r\n",
            "\r\nДля того чтобы протестировать ваше приложение с чёлкой, нужна (спасибо, кэп!) Android P. В данный момент доступна версия Android P Preview 5 для следующих устройств (спасибо Project Treble):",
            "\r\nEssential Phone;",
            "\r\nGoogle Pixel 2;",
            "\r\nGoogle Pixel 2 XL;",
            "\r\nGoogle Pixel;",
            "\r\nGoogle Pixel XL;",
            "\r\nNokia 7 plus;",
            "\r\nOnePlus 6;",
            "\r\nOppo R15 Pro;",
            "\r\nSony Xperia XZ2;",
            "\r\nVivo X21UD;",
            "\r\nVivo X21;",
            "\r\nXiaomi Mi Mix 2S.",
            "\r\n",
            "\r\nЧтобы установить Android P на устройство, достаточно перейти ",
            " и нажать «Получить бета-версию» для вашего устройства. Получать её по воздуху или накатывать самому — выбор за вами. Инструкция на сайте прилагается.",
            "\r\nНо если вы не можете или не хотите устанавливать Android P на устройство, то никто не отменял эмулятор. Иструкция по настройке ",
            ".",
            "\r\n",
            "\r\n",
            "\r\nТут всё просто: идём в System -> Developer options -> Simulate a display with a cutout.",
            "\r\nЗдесь на выбор предоставляются 3 варианта:",
            "\r\n",
            "\r\n",
            "\r\nВыглядят они следующим образом:",
            "\r\n",
            "\r\n",
            "\r\nСамо собой, этот кейс у всех будет разный. У кого-то простая логика, у кого-то не очень. Приведу пару примеров экранов с поехавшей вёрсткой, которые я нашёл в нашем приложении.",
            "\r\n",
            "\r\nТеперь давайте посмотрим, какие есть способы устранения недостатков вёрстки.",
            "\r\n",
            "\r\n",
            " Начиная с 20 API, появился класс ",
            ", который представляет собой объекты ",
            ", описывающие доступные и недоступные части экрана. Вместе с ними во View появились такие методы, с помощью которых мы можем обрабатывать координаты недоступных частей экрана:",
            "\r\n",
            "\r\n",
            "\r\nПодробно о том, как ими пользоваться, ",
            ".",
            "\r\n",
            "\r\nИспользовать эти методы можно двумя способами:",
            "\r\nа) поставить тег ",
            " в вёрстке на ваш layout или view;",
            "\r\nб) сделать это из кода:",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            " В ближайшем будущем придётся переходить на эту версию, так почему бы не подготовиться к этому сейчас? Но будьте внимательны, если у вас в проекте есть юнит-тесты (а я надеюсь, они у вас есть), пакет JUnit переехал. Как его подключать, описано ",
            ".",
            "\r\n",
            "\r\nИтак, какие варианты теперь предоставляет нам Android P?",
            "\r\n",
            "\r\nА. У WindowManager.LayoutParams появилось 3 новых флага:",
            "\r\n",
            "\r\nКак применять?",
            "\r\n",
            "\r\n",
            "\r\nБ. Если же вариант А вам не подходит и нужно учитывать именно расположение злополучного выреза (например, у вас что-то отображается прямо в статус-баре, как сообщения о соединении в Telegram), то в данном случае поможет новый класс ",
            ".",
            "\r\nРассмотрим его методы:",
            "\r\n",
            "\r\nС ними вы сможете уже сделать всё, на что хватит фантазии. Хотите — двигайте ",
            " в коде по ним. Хотите — обрабатывайте в ",
            " и делайте ",
            ". Возможно, вам нужны более сложные манипуляции. Я приведу простой пример, как обозначить чёлку.",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\n",
            "\r\nИтак, как мы видим, чёлка принесёт нам некоторые неудобства и заставит совершить лишние телодвижения/дополнительные манипуляции. В принципе, всё решаемо. Главное, приступить к устранению недостатков вёрстки как можно раньше, чтобы иметь в запасе достаточно времени на подготовку. Удачно вам справиться с правками. Да не сломает Google свой Play!"
        ],
        "title": "«Поясняем за чёлку» в Android P. Что делать с Android Cutout?"
    },
    {
        "images": [
            "https://habrastorage.org/webt/nl/rb/xz/nlrbxzadivtxzkni-84e5a-u01o.jpeg",
            "https://habrastorage.org/webt/nm/rz/xs/nmrzxsaodvu2xyervhgvup0zqg0.png",
            "https://habrastorage.org/webt/2j/yb/zs/2jybzsjmtewlyhsvey44_gtwqn4.jpeg",
            "https://habrastorage.org/webt/4w/jj/s3/4wjjs3kqj6h0crrlicn93nxuq4w.png"
        ],
        "text": [
            "Привет, Хабр!",
            "\r\n",
            "\r\n",
            "\r\nЗа неделю произошло много всего интересного, и мы, как обычно, рассказываем об этих событиях:",
            "\r\n",
            "\r\n",
            " ",
            "\r\n",
            "\r\n",
            "\r\n ",
            "\r\nНа всех углах гремит ",
            ", что корпорация Apple поставила рекорд — её рыночная капитализация выросла до $1 трлн. 2 августа её акции поднялись в цене до $207,05, что и позволило ей стать еще богаче, чем раньше.",
            "\r\n ",
            "\r\nТим Кук по этому поводу шампанское не пил (хотя, как знать), а просто заявил следующее: ",
            "И в самом деле, несмотря на критику, устройства компании продаются отлично, сервисы действуют, а деньги продолжают поступать на счет. По мнению специалистов, компания достигает успеха не только благодаря удачным бизнес-ходам, но и благодаря позиционированию бренда.",
            "\r\n ",
            "\r\n",
            "\r\n",
            "\r\n ",
            "\r\nКомпания eBay работает не всегда успешно. Не так давно она заявляла об убытках. Но сегодня на ее улице — праздник, поскольку затраты на внедрение ИИ окупились сполна. Дело в том, что eBay внедрила технологию искусственного интеллекта для более качественного взаимодействия с пользователями.",
            "\r\n ",
            "\r\nВ принципе, машинное обучение компания использует с этой целью уже более десяти лет, но сейчас ее труды ",
            ". Как оказалось, ИИ позволил заработать на $1 млрд больше (в квартал), чем в обычной ситуации.",
            "\r\n ",
            "\r\nПравда, речь идет не о прибыли, а об объеме продаж. Но все равно, внедрение новой технологии того стоило. Продавцы и покупатели видят персонализированный контент и активно пользуются новыми возможностями. По словам представителей eBay, компания для улучшения своей работы использует многие современные технологии, включая Big Data, глубокое обучение, ИИ и другие методы и системы.",
            "\r\n ",
            "\r\n",
            "\r\n",
            "\r\n ",
            "\r\nОснователь известнейшего ресурса «Википедия» Джимми Уэйлс ",
            ", что не будет проводить ICO или же выпускать собственную криптовалюту. Он считает, что блокчейн является «суперинтересной технологией», но все равно это «пузырь».",
            "\r\n ",
            "\r\nРанее он же заявлял, что ICO — это «полнейший скам», а криптовалюты и все, что с ними связано — просто пузырь.",
            "\r\n ",
            "\r\n",
            "\r\n",
            "\r\n ",
            "\r\nНа Хабре уже публиковалась новость о том, что компания Long Blockchain Corp., которая на самом деле занимается производством холодного чая и лимонада, смогла увеличить капитализацию после добавления слова Blockchain в свое название. Раньше его там не было.",
            "\r\n ",
            "\r\nАкции фирмы ",
            ", капитализация ее увеличилась до $70 млн. Тем не менее, через время подъем прекратился, капитализация начала понижаться, а Nasdaq решила провести делистинг акций компании.",
            "\r\n ",
            "\r\nВсе бы хорошо, но этот хитрый ход был замечен регулятором, Комиссией по ценным бумагам и биржам США (SEC). Организация запросила документацию от Long Blockchain Corp.",
            "\r\n ",
            "\r\nПока что неясно, что ей предстоит, и будет ли возбуждено разбирательства. Но то, что с SEC шутки плохи, знают все."
        ],
        "title": "Финтех-дайджест: капитализация Apple превысила $1 трлн, ИИ помог eBay поднять выручку на миллиарды"
    }
]